In [1]:
#in 8-11-2020

import pandas as pd
import numpy as np

my_product = [
    
    ('saeed' , 'cooder' , 'saudi arabia' , 50000),
    ('mohamed' , 'frontend', 'egypt' , 140000),
    ('mohab' , 'backend' , 'tunis'  , 110000),
    ('sara' , 'design' , 'algeria' , 90000),
    ('mahmoud' , 'coders', 'sudan' , 60000),
    ('hind' , 'backend' , 'maly' , 70000),
    ('yara' , 'software' , 'dubai', 110000),
    ('mohab' , 'applications', 'kuwait', 100000),
    ('nawaf' , 'backend' , 'saudi', 100000),
    ('mahmoud' , 'fronend' , 'egypt' , 50000)]

data = pd.DataFrame( my_product , columns=['name' , 'job' , 'country' , 'salary'])


data.head()

      name       job       country  salary
0    saeed    cooder  saudi arabia   50000
1  mohamed  frontend         egypt  140000
2    mohab   backend         tunis  110000
3     sara    design       algeria   90000
4  mahmoud    coders         sudan   60000

In [2]:
data.value_counts()

name     job           country       salary
yara     software      dubai         110000    1
sara     design        algeria       90000     1
saeed    cooder        saudi arabia  50000     1
nawaf    backend       saudi         100000    1
mohamed  frontend      egypt         140000    1
mohab    backend       tunis         110000    1
         applications  kuwait        100000    1
mahmoud  fronend       egypt         50000     1
         coders        sudan         60000     1
hind     backend       maly          70000     1
dtype: int64

In [3]:
data['salary'].value_counts()

110000    2
100000    2
50000     2
70000     1
140000    1
60000     1
90000     1
Name: salary, dtype: int64

In [4]:
data.columns

Index(['name', 'job', 'country', 'salary'], dtype='object')

In [6]:
data.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['name', 'job', 'country', 'salary'], dtype='object')]

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     10 non-null     object
 1   job      10 non-null     object
 2   country  10 non-null     object
 3   salary   10 non-null     int64
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

In [10]:
data['salary'].name

'salary'

In [11]:
type(data['name'])

pandas.core.series.Series

In [14]:
type(data[['name' , 'salary']])

pandas.core.frame.DataFrame

In [16]:
data['name'].head()

0      saeed
1    mohamed
2      mohab
3       sara
4    mahmoud
Name: name, dtype: object

In [19]:
data['new'] = "new columns"

data.head()

      name       job       country  salary          new
0    saeed    cooder  saudi arabia   50000  new columns
1  mohamed  frontend         egypt  140000  new columns
2    mohab   backend         tunis  110000  new columns
3     sara    design       algeria   90000  new columns
4  mahmoud    coders         sudan   60000  new columns

In [24]:
data.insert(3 , column='learn' , value='heighSchools')

data.head()

,name,job,country,learn,Ages,Age,salary,new
0,saeed,cooder,saudi arabia,heighSchools,25,25,50000,new columns
1,mohamed,frontend,egypt,heighSchools,25,25,140000,new columns
2,mohab,backend,tunis,heighSchools,25,25,110000,new columns
3,sara,design,algeria,heighSchools,25,25,90000,new columns
4,mahmoud,coders,sudan,heighSchools,25,25,60000,new columns